{
  "developer": "",
  "commandLine": "",
  "supersedingAppCount": 0,
  "publisher": "Google Inc.",
  "id": "8b440faa-cde0-495f-95e8-68e71a3a7ba1",
  "displayName": "Google Chrome",
  "isAssigned": false,
  "uploadState": 1,
  "isFeatured": false,
  "dependentAppCount": 0,
  "useDeviceContext": null,
  "supersededAppCount": 0,
  "lastModifiedDateTime": "2025-04-10T21:46:41.4782992Z",
  "ignoreVersionDetection": true,
  "fileName": "GoogleChromeStandaloneEnterprise64.msi",
  "productVersion": "135.0.7049.85",
  "size": 132001856,
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps/$entity",
  "identityVersion": "135.0.7049.85",
  "createdDateTime": "2025-04-10T21:46:41.4782992Z",
  "roleScopeTagIds": [
    "0"
  ],
  "largeIcon": null,
  "owner": "",
  "notes": "",
  "informationUrl": null,
  "publishingState": "published",
  "privacyInformationUrl": "",
  "committedContentVersion": "1",
  "productCode": "{138D2D03-6550-3989-85BA-178F9BBA2D6F}",
  "description": "Google Chrome",
  "@odata.type": "#microsoft.graph.windowsMobileMSI"
}
