{
  "developer": "",
  "commandLine": "/quiet",
  "supersedingAppCount": 0,
  "publisher": "Progress Inc",
  "id": "ea89126f-b44d-4f78-a0fd-0eb3bcec9567",
  "displayName": "ShareFile",
  "isAssigned": false,
  "uploadState": 1,
  "isFeatured": false,
  "dependentAppCount": 0,
  "useDeviceContext": null,
  "supersededAppCount": 0,
  "lastModifiedDateTime": "2025-04-16T19:46:07.5921043Z",
  "ignoreVersionDetection": false,
  "fileName": "ShareFileForWindows_x64_v24.10.3.0.msi",
  "productVersion": "24.10.3.0",
  "size": 28995648,
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps/$entity",
  "identityVersion": "24.10.3.0",
  "createdDateTime": "2025-04-16T19:46:07.5921043Z",
  "roleScopeTagIds": [
    "0"
  ],
  "largeIcon": null,
  "owner": "",
  "notes": "",
  "informationUrl": null,
  "publishingState": "published",
  "privacyInformationUrl": "",
  "committedContentVersion": "1",
  "productCode": "{FE46617C-3751-403B-8FA2-23ADAA272A43}",
  "description": "ShareFile",
  "@odata.type": "#microsoft.graph.windowsMobileMSI"
}
