{
  "defenderVersion": null,
  "passwordMinimumCharacterSetCount": null,
  "antivirusRequired": true,
  "passwordRequiredType": "deviceDefault",
  "configurationManagerComplianceRequired": false,
  "activeFirewallRequired": true,
  "passwordExpirationDays": null,
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "passwordMinutesOfInactivityBeforeLock": null,
  "codeIntegrityEnabled": false,
  "osMaximumVersion": null,
  "firmwareProtectionEnabled": false,
  "id": "a2342ef8-3ae2-403b-bfa0-8a1dbb3a95b4",
  "memoryIntegrityEnabled": false,
  "passwordPreviousPasswordBlockCount": null,
  "kernelDmaProtectionEnabled": false,
  "passwordRequired": false,
  "bitLockerEnabled": false,
  "roleScopeTagIds": [
    "0"
  ],
  "version": 6,
  "description": "Default Compliance Policy",
  "osMinimumVersion": null,
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "tpmRequired": false,
  "passwordRequiredToUnlockFromIdle": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "signatureOutOfDate": false,
  "displayName": "Default Compliance Policy",
  "deviceThreatProtectionEnabled": false,
  "antiSpywareRequired": false,
  "passwordMinimumLength": null,
  "virtualizationBasedSecurityEnabled": false,
  "passwordBlockSimple": false,
  "requireHealthyDeviceReport": false,
  "wslDistributions": [],
  "rtpEnabled": false,
  "mobileOsMaximumVersion": null,
  "mobileOsMinimumVersion": null,
  "lastModifiedDateTime": "2025-04-21T16:27:44.6944708Z",
  "createdDateTime": "2025-04-16T18:34:13.2502513Z",
  "storageRequireEncryption": false,
  "validOperatingSystemBuildRanges": [],
  "deviceCompliancePolicyScript": null,
  "secureBootEnabled": false,
  "defenderEnabled": false
}
