{
  "roleScopeTagIds": [
    "0"
  ],
  "templateReference": {
    "templateId": "e8c053d6-9f95-42b1-a7f1-ebfd71c67a4b_1",
    "templateDisplayVersion": "Version 1",
    "templateFamily": "endpointSecurityAttackSurfaceReduction",
    "templateDisplayName": "Attack Surface Reduction Rules"
  },
  "description": "Basic Attack Surface Reduction Policy",
  "id": "91052e66-9df6-4a0a-9862-5a979240916d",
  "name": "Basic Attack Surface Reduction",
  "creationSource": null,
  "lastModifiedDateTime": "2025-04-18T21:59:55.9146072Z",
  "priorityMetaData": null,
  "platforms": "windows10",
  "settingCount": 1,
  "createdDateTime": "2025-04-18T21:58:17.8344291Z",
  "technologies": "mdm,microsoftSense",
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "19600663-e264-4c02-8f55-f2983216d6d7"
        },
        "groupSettingCollectionValue": [
          {
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb",
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "fc561d60-fdd7-4f59-8204-bd53ca3fb8da"
                },
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": {
                    "useTemplateDefault": false,
                    "settingValueTemplateId": "ec657920-0f8a-4d6c-9ad4-04281db1963e"
                  },
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutionofpotentiallyobfuscatedscripts",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutionofpotentiallyobfuscatedscripts_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockcredentialstealingfromwindowslocalsecurityauthoritysubsystem",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockcredentialstealingfromwindowslocalsecurityauthoritysubsystem_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_useadvancedprotectionagainstransomware",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_useadvancedprotectionagainstransomware_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockjavascriptorvbscriptfromlaunchingdownloadedexecutablecontent",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockjavascriptorvbscriptfromlaunchingdownloadedexecutablecontent_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwin32apicallsfromofficemacros",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwin32apicallsfromofficemacros_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficecommunicationappfromcreatingchildprocesses",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficecommunicationappfromcreatingchildprocesses_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockallofficeapplicationsfromcreatingchildprocesses",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockallofficeapplicationsfromcreatingchildprocesses_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablecontentfromemailclientandwebmail",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablecontentfromemailclientandwebmail_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablefilesrunningunlesstheymeetprevalenceagetrustedlistcriterion",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablefilesrunningunlesstheymeetprevalenceagetrustedlistcriterion_audit"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "settingValueTemplateReference": null
          }
        ],
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance"
      }
    }
  ]
}
