{
  "roleScopeTagIds": [
    "0"
  ],
  "templateReference": {
    "templateId": "46ddfc50-d10f-4867-b852-9434254b3bff_1",
    "templateDisplayVersion": "Version 1",
    "templateFamily": "endpointSecurityDiskEncryption",
    "templateDisplayName": "BitLocker"
  },
  "description": "Enforce Bitlocker Requirements",
  "id": "5d1f03ac-5a84-4a51-ab84-01d729e5de3a",
  "name": "Bitlocker Encryption",
  "creationSource": null,
  "lastModifiedDateTime": "2025-04-16T19:28:30.8143882Z",
  "priorityMetaData": null,
  "platforms": "windows10",
  "settingCount": 6,
  "createdDateTime": "2025-04-15T15:58:56.1803081Z",
  "technologies": "mdm",
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_requiredeviceencryption",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "20ec1f6e-0d7a-4b6f-9a4f-9ed33e69ce51"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "86da5fa5-67cf-48d1-8215-8787a9900ae6"
          },
          "value": "device_vendor_msft_bitlocker_requiredeviceencryption_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "e40531ee-2225-406b-b07b-1c17186c088c"
        },
        "choiceSettingValue": {
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_allowstandarduserencryption",
              "settingInstanceTemplateReference": null,
              "choiceSettingValue": {
                "children": [],
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "7d348597-0f2a-43db-9fad-8b55c4f89bfe"
                },
                "value": "device_vendor_msft_bitlocker_allowstandarduserencryption_1"
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "7d348597-0f2a-43db-9fad-8b55c4f89bfe"
          },
          "value": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_0"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "2",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d1625438-8db8-424f-b605-cf001b7a2f97"
        },
        "choiceSettingValue": {
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name",
              "settingInstanceTemplateReference": null,
              "choiceSettingValue": {
                "children": [],
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf"
                },
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_4"
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name",
              "settingInstanceTemplateReference": null,
              "choiceSettingValue": {
                "children": [],
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf"
                },
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_4"
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name",
              "settingInstanceTemplateReference": null,
              "choiceSettingValue": {
                "children": [],
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf"
                },
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_4"
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf"
          },
          "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "3",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d3e31794-1ce6-4572-ab0c-0c0f9200a509"
        },
        "choiceSettingValue": {
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name",
              "settingInstanceTemplateReference": null,
              "choiceSettingValue": {
                "children": [],
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe"
                },
                "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_1"
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe"
          },
          "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "4",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "85a47676-5027-4b14-9f99-e4625728244a"
        },
        "choiceSettingValue": {
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name",
              "settingInstanceTemplateReference": null,
              "choiceSettingValue": {
                "children": [],
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297"
                },
                "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_2"
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297"
          },
          "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "5",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "ad21af4f-e42f-4870-85d8-1949e9adfad7"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68"
          },
          "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_0"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    }
  ]
}
