{
  "roleScopeTagIds": [
    "0"
  ],
  "templateReference": {
    "templateId": "0385b795-0f2f-44ac-8602-9f65bf6adede_1",
    "templateDisplayVersion": "Version 1",
    "templateFamily": "endpointSecurityEndpointDetectionAndResponse",
    "templateDisplayName": "Endpoint detection and response"
  },
  "description": "Default Endpoint Detection and Response Policy",
  "id": "d011d91d-e491-4dd2-8584-fe3de25b111a",
  "name": "Default Endpoint Detection and Response Policy",
  "creationSource": null,
  "lastModifiedDateTime": "2025-04-17T13:11:47.0069936Z",
  "priorityMetaData": null,
  "platforms": "windows10",
  "settingCount": 2,
  "createdDateTime": "2025-04-17T13:11:47.0069936Z",
  "technologies": "mdm,microsoftSense",
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "23ab0ea3-1b12-429a-8ed0-7390cf699160"
        },
        "choiceSettingValue": {
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_onboarding_fromconnector",
              "settingInstanceTemplateReference": null,
              "simpleSettingValue": {
                "valueState": "encryptedValueToken",
                "settingValueTemplateReference": null,
                "value": "2a050e2c-7a27-4f21-9fbd-9df6da04c1ac",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue"
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "e5c7c98c-c854-4140-836e-bd22db59d651"
          },
          "value": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype_autofromconnector"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "6998c81e-2814-4f5e-b492-a6159128a97b"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "f72c326c-7c5b-4224-b890-0b9b54522bd9"
          },
          "value": "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    }
  ]
}
