{
  "roleScopeTagIds": [
    "0"
  ],
  "templateReference": {
    "templateId": "804339ad-1553-4478-a742-138fb5807418_1",
    "templateDisplayVersion": "Version 1",
    "templateFamily": "endpointSecurityAntivirus",
    "templateDisplayName": "Microsoft Defender Antivirus"
  },
  "description": "Microsoft Defender Default Policy",
  "id": "d78dc3fd-11fa-451a-a610-9fb92bf9c4d0",
  "name": "Microsoft Defender Default Policy",
  "creationSource": null,
  "lastModifiedDateTime": "2025-04-16T14:32:37.3202091Z",
  "priorityMetaData": null,
  "platforms": "windows10",
  "settingCount": 20,
  "createdDateTime": "2025-04-09T13:47:59.9669295Z",
  "technologies": "mdm,microsoftSense",
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowarchivescanning",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "7c5c9cde-f74d-4d11-904f-de4c27f72d89"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "9ead75d4-6f30-4bc5-8cc5-ab0f999d79f0"
          },
          "value": "device_vendor_msft_policy_config_defender_allowarchivescanning_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "8eef615a-1aa0-46f4-a25a-12cbe65de5ab"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "905921da-95e2-4a10-9e30-fe5540002ce1"
          },
          "value": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "2",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowcloudprotection",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "7da139f1-9b7e-407d-853a-c2e5037cdc70"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "16fe8afd-67be-4c50-8619-d535451a500c"
          },
          "value": "device_vendor_msft_policy_config_defender_allowcloudprotection_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "3",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowemailscanning",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "b0d9ee81-de6a-4750-86d7-9397961c9852"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "fdf107fd-e13b-4507-9d8f-db4d93476af9"
          },
          "value": "device_vendor_msft_policy_config_defender_allowemailscanning_0"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "4",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "dac47505-f072-48d6-9f23-8d93262d58ed"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "3e920b10-3773-4ac5-957e-e5573aec6d04"
          },
          "value": "device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives_0"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "5",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "fb36e70b-5bc9-488a-a949-8ea3ac1634d5"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "366c5727-629b-4a81-b50b-52f90282fa2c"
          },
          "value": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "6",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowintrusionpreventionsystem",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d47f06e2-5378-43f2-adbc-e924538f1512"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "03738a99-7065-44cb-ba1e-93530ed906a7"
          },
          "value": "device_vendor_msft_policy_config_defender_allowintrusionpreventionsystem_0"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "7",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowioavprotection",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "fa06231d-aed4-4601-b631-3a37e85b62a0"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "df4e6cbd-f7ff-41c8-88cd-fa25264a237e"
          },
          "value": "device_vendor_msft_policy_config_defender_allowioavprotection_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "8",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f0790e28-9231-4d37-8f44-84bb47ca1b3e"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "0492c452-1069-4b91-9363-93b8e006ab12"
          },
          "value": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "9",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowscanningnetworkfiles",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f8f28442-0a6b-4b52-b42c-d31d9687c1cf"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "7b8c858c-a17d-4623-9e20-f34b851670ce"
          },
          "value": "device_vendor_msft_policy_config_defender_allowscanningnetworkfiles_0"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "10",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowscriptscanning",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "000cf176-949c-4c08-a5d4-90ed43718db7"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "ab9e4320-c953-4067-ac9a-be2becd06b4a"
          },
          "value": "device_vendor_msft_policy_config_defender_allowscriptscanning_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "11",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowuseruiaccess",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "0170a900-b0bc-4ccc-b7ce-dda9be49189b"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "4b6c9739-4449-4006-8e5f-3049136470ea"
          },
          "value": "device_vendor_msft_policy_config_defender_allowuseruiaccess_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "12",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "4fea56e3-7bb6-4ad3-88c6-e364dd2f97b9"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "010779d1-edd4-441d-8034-89ad57a863fe"
          },
          "value": "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan_0"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "13",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudblocklevel",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "c7a37009-c16e-4145-84c8-89a8c121fb15"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "517b4e84-e933-42b9-b92f-00e640b1a82d"
          },
          "value": "device_vendor_msft_policy_config_defender_cloudblocklevel_2"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "14",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_disablecatchupfullscan",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f881b08c-f047-40d2-b7d9-3dde7ce9ef64"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "1b26092f-48c4-447b-99d4-e9c501542f1c"
          },
          "value": "device_vendor_msft_policy_config_defender_disablecatchupfullscan_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "15",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_disablecatchupquickscan",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "dabf6781-9d5d-42da-822a-d4327aa2bdd1"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "d263ced7-0d23-4095-9326-99c8b3f5d35b"
          },
          "value": "device_vendor_msft_policy_config_defender_disablecatchupquickscan_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "16",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablelowcpupriority",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "cdeb96cf-18f5-4477-a710-0ea9ecc618af"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "045a4a13-deee-4e24-9fe4-985c9357680d"
          },
          "value": "device_vendor_msft_policy_config_defender_enablelowcpupriority_0"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "17",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablenetworkprotection",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f53ab20e-8af6-48f5-9fa1-46863e1e517e"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "ee58fb51-9ae5-408b-9406-b92b643f388a"
          },
          "value": "device_vendor_msft_policy_config_defender_enablenetworkprotection_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "id": "18",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f6394bc5-6486-4728-b510-555f5c161f2b"
        },
        "groupSettingCollectionValue": [
          {
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats",
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "f55b8c9c-d831-460e-a041-e47e29f2aa17"
                },
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": {
                    "useTemplateDefault": false,
                    "settingValueTemplateId": "764256b4-e4d7-46d9-bbc8-003bf23591a1"
                  },
                  "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_quarantine"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "children": [],
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats_block"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "settingValueTemplateReference": null
          }
        ],
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance"
      }
    },
    {
      "id": "19",
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_defender_configuration_allownetworkprotectiondownlevel",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d7342aaf-833d-4afc-92d6-e9621256a3cc"
        },
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "248fdbe0-e0c9-4b47-bce1-95c8058736fb"
          },
          "value": "device_vendor_msft_defender_configuration_allownetworkprotectiondownlevel_0"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    }
  ]
}
